Revit 2027 API
IExternalService.IsValidServer Method
 Implement this method to check if the given instance represents a valid server of this service.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
bool IsValidServer(
	IExternalServer server
)
Function IsValidServer (
	server As IExternalServer
) As Boolean
bool IsValidServer(
	IExternalServer^ server
)
abstract IsValidServer :
        server : IExternalServer -> bool
Parameters
server IExternalServer
 An instance of a server that is to be validated.
Return Value
Boolean
 True if the server is valid, False otherwise
Remarks
 This method is invoked by the framework upon registration of a server for this service. The simplest implementation would be to test whether the type of the object is as expected, but a service may have other rules for validating its servers.
See Also
Reference
IExternalService Interface
Autodesk.Revit.DB.ExternalService Namespace